{
    "Layered Architecture": {
      "image": "https://miro.medium.com/v2/resize:fit:960/1*Fj3nKsTmQ86cFL9GrvYu1g.png",
      "description": "Layered Architecture organizes the application into horizontal layers, where each layer performs a specific role (e.g., presentation, business logic, data access). This pattern promotes separation of concerns and maintainability but can lead to tight coupling if not implemented carefully."
    },
    "Event-Driven Architecture (Pub-Sub Architecture)": {
      "image": "https://deploy.equinix.com/media/images/8Y1K-event.driven.architecture.png",
      "description": "Event-Driven Architecture centers around the production, detection, consumption of, and reaction to events. Components communicate by publishing events to an event bus, and other components can subscribe to these events. It enables loose coupling, scalability, and responsiveness."
    },
    "Microkernel Architecture": {
      "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRL-PTqndhawCmbivr-mvP2vEA_-ebN2Jp9RQ&s",
      "description": "Microkernel Architecture consists of a core system (kernel) that provides minimal functionalities and plugin modules that extend the core's capabilities. This pattern is suitable for applications with a clear set of core responsibilities and a need for dynamic extensibility."
    },
    "Microservices Architecture": {
      "image": "https://qentelli.com/sites/default/files/inline-images/gateway-routing-pattern.png",
      "description": "Microservices Architecture structures an application as a collection of small, independent services that communicate over a network. Each service focuses on a specific business capability and can be developed, deployed, and scaled independently, offering flexibility and resilience."
    },
    "Space-Based Architecture": {
      "image": "https://i.ytimg.com/vi/WHTbZHYBia8/maxresdefault.jpg",
      "description": "Space-Based Architecture (also known as Tuple Space Architecture) uses shared memory spaces to enable communication and coordination between distributed processes. It is well-suited for applications with high scalability and fault tolerance requirements."
    },
    "Pipeline Architecture (Pipe-Filter Architecture)": {
      "image": "https://media.geeksforgeeks.org/wp-content/uploads/20241003120154/Pipe-and-Filter-Architecture---System-Design-image.webp",
      "description": "Pipeline Architecture organizes the system into a series of processing stages (filters) connected by channels (pipes). Data flows through the pipeline, being transformed at each stage. It simplifies complex processing tasks by breaking them into smaller, independent steps."
    },
    "Service-Based Architecture": {
      "image": "https://umairsaeed.com/img/Paper-2023-Architecture-04-SOA-02w.png",
      "description": "Service-Based Architecture structures the application into a set of services, similar to microservices but typically with larger-grained services that encapsulate more business logic. Services communicate with each other over a network and are often designed for reusability."
    },
    "Client-Server Architecture": {
      "image": "https://miro.medium.com/v2/resize:fit:1038/1*qaevMfJ2aX0X6a4m98TLqA.png",
      "description": "Client-Server Architecture separates the application into client components that request services and server components that provide services. This pattern is common in web applications, where the browser acts as the client and a web server acts as the server."
    }
  }