{
    "description": "This web application concerns a map that the user can interact with to search and locate recycling and waste disposal facilities.",
    "Functionality": [
      "As a user, I want to have a great UI and UX from the sites, so that I have a pleasant experience when navigating through them.",
      "As a user, I want to view user documentation for the website, so that I know how to use the web app.",
      "As a company, I want to have a website that is easy to use, so that I can upload or delete stuff step by step.",
      "As a user, I want to be able to browse through the list of facilities and see which ones are environment-friendly, so that I can know for sure my waste is not going to leave a negative ecological footprint.",
      "As a user, I want to be able to give my email ID, so that I can receive notifications for new events as they are posted.",
      "As a user, I want to get feedback when I enter an invalid zip code.",
      "As a user, I want to be able to view the safe disposal events currently being organised around my area.",
      "As a user, I want to be able to receive tempting rewards, so that I have a reason to use the website.",
      "As a user, I want to add donation centers as favorites on my profile, so that I can view them later.",
      "As a user, I want to be able to create an account, so that I can create my own profile.",
      "As a user, I want to be able to check transaction history and keep a record of it, so that I can go back when needed."
    ],
    "Integrability & Interoperability": [
      "As a user, I want to be able to access the site and do all the other stuffs on all of my electronic devices.",
      "As a user, I want to click on the address, so that it takes me to a new tab with Google Maps.",
      "As a user, I want to be able to enter my zip code and get a list of nearby recycling facilities, so that I can determine which ones I should consider.",
      "As a user, I want to be able to get the hours of each recycling facility, so that I can arrange drop-offs on my off days or during after-work hours.",
      "As a user, I want to be able to select different types of recyclable waste, so I have and get a list of facilities that accept each type and their opening hours, so that I can find an optimal route and schedule.",
      "As a user, I want to view all locations of recycling centers on a map, so that I can check which routes to take to drop off waste.",
      "As a user, I want to be able to view a map display of the public recycling bins around my area.",
      "As a user, I want to be able to view a map display of the special waste drop off sites around my area."
    ],
    "Security & Confidentiality": [
      "As an admin, I want to have all data encrypted, so that important information will not be stolen during a server breach or an attack.",
      "As an executive, I want to have full access to data related to my company, so that I can have a sense of my company's performance.",
      "As an employee from the HR department, I want to have access to the full information of all employees working for this business.",
      "As a user, I want to link my email account to my profile, so that I can get a temporary password in case I forget my own one.",
      "As a user, I want to have my personal information kept securely in the database of the website, so that I will not suffer from identity theft or telephone harassment.",
      "As a user, I want to be able to anonymously view public information, so that I know about recycling centers near me before creating an account."
    ],
    "Manageability & Maintainability": [
      "As an admin, I want to be able to add or remove recycling facilities' information, so that users get the most recent information.",
      "As an admin, I want to be able to read users' feedback and complaints, so that we can add more features and keep improving the service we provide to them.",
      "As an admin, I want to be able to block specific users based on IP address, so that I can prevent spamming on the websites.",
      "As an admin, I want to view a dashboard that monitors all the sites' statuses, so that I can have a sense of what people are doing on our sites and know the service status.",
      "As an admin, I want to handle all users' activities, so that I can manage more efficiently.",
      "As an admin, I want to onboard recycling centers on the platform, so that I can increase information accuracy.",
      "As an admin, I want to be able to have a dashboard that shows usage stats and locations, so that I can identify the neighbourhoods with the largest number of drop-offs and to try getting more facilities involved.",
      "As an admin, I want to be able to communicate directly with facilities, so that I can keep them updated about features we have on our website."
    ],
    "Modularity & Extensibility": [
    ],
    "Performance Efficiency & Resource Utilization": [
      "As an employee, I want to access the route planning system during work, so that I can be guided through the neighbourhood.",
      "As an employee, I want to get quick notifications, so that I can process cases the first time."
    ],
    "Implementability & Ease of Development": [
      "As a developer, I want to use bootstrap in the process of developing, so that I can easily design my website.",
      "As a developer, I want to access an API from the website, so that I can integrate it and implement certain features in my own iOS application."
    ],
    "Analyzability & Traceability": [
      "As a company accountant, I want to view all available activity fees online, so that I can easily create a bill statement.",
      "As an admin, I want to view user error logs, so that I can fix or review any issues that are being faced by users of the system."
    ]
  }